; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city7)
	(= (capacity plane1) 12394)
	(= (fuel plane1) 3381)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 18)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 1)
	(at plane2 city6)
	(= (capacity plane2) 2585)
	(= (fuel plane2) 768)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 3)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 5)
	(at person1 city5)
	(at person2 city0)
	(at person3 city0)
	(at person4 city8)
	(at person5 city5)
	(at person6 city5)
	(at person7 city6)
	(at person8 city9)
	(at person9 city6)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 936)
	(= (distance city0 city2) 818)
	(= (distance city0 city3) 977)
	(= (distance city0 city4) 717)
	(= (distance city0 city5) 804)
	(= (distance city0 city6) 666)
	(= (distance city0 city7) 619)
	(= (distance city0 city8) 682)
	(= (distance city0 city9) 925)
	(= (distance city1 city0) 936)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 746)
	(= (distance city1 city3) 905)
	(= (distance city1 city4) 727)
	(= (distance city1 city5) 975)
	(= (distance city1 city6) 656)
	(= (distance city1 city7) 883)
	(= (distance city1 city8) 863)
	(= (distance city1 city9) 871)
	(= (distance city2 city0) 818)
	(= (distance city2 city1) 746)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 989)
	(= (distance city2 city4) 697)
	(= (distance city2 city5) 715)
	(= (distance city2 city6) 609)
	(= (distance city2 city7) 577)
	(= (distance city2 city8) 871)
	(= (distance city2 city9) 566)
	(= (distance city3 city0) 977)
	(= (distance city3 city1) 905)
	(= (distance city3 city2) 989)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 775)
	(= (distance city3 city5) 747)
	(= (distance city3 city6) 603)
	(= (distance city3 city7) 850)
	(= (distance city3 city8) 781)
	(= (distance city3 city9) 734)
	(= (distance city4 city0) 717)
	(= (distance city4 city1) 727)
	(= (distance city4 city2) 697)
	(= (distance city4 city3) 775)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 700)
	(= (distance city4 city6) 717)
	(= (distance city4 city7) 552)
	(= (distance city4 city8) 678)
	(= (distance city4 city9) 934)
	(= (distance city5 city0) 804)
	(= (distance city5 city1) 975)
	(= (distance city5 city2) 715)
	(= (distance city5 city3) 747)
	(= (distance city5 city4) 700)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 856)
	(= (distance city5 city7) 844)
	(= (distance city5 city8) 554)
	(= (distance city5 city9) 539)
	(= (distance city6 city0) 666)
	(= (distance city6 city1) 656)
	(= (distance city6 city2) 609)
	(= (distance city6 city3) 603)
	(= (distance city6 city4) 717)
	(= (distance city6 city5) 856)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 769)
	(= (distance city6 city8) 801)
	(= (distance city6 city9) 945)
	(= (distance city7 city0) 619)
	(= (distance city7 city1) 883)
	(= (distance city7 city2) 577)
	(= (distance city7 city3) 850)
	(= (distance city7 city4) 552)
	(= (distance city7 city5) 844)
	(= (distance city7 city6) 769)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 997)
	(= (distance city7 city9) 776)
	(= (distance city8 city0) 682)
	(= (distance city8 city1) 863)
	(= (distance city8 city2) 871)
	(= (distance city8 city3) 781)
	(= (distance city8 city4) 678)
	(= (distance city8 city5) 554)
	(= (distance city8 city6) 801)
	(= (distance city8 city7) 997)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 601)
	(= (distance city9 city0) 925)
	(= (distance city9 city1) 871)
	(= (distance city9 city2) 566)
	(= (distance city9 city3) 734)
	(= (distance city9 city4) 934)
	(= (distance city9 city5) 539)
	(= (distance city9 city6) 945)
	(= (distance city9 city7) 776)
	(= (distance city9 city8) 601)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city5)
	(at person2 city1)
	(at person3 city7)
	(at person4 city0)
	(at person5 city7)
	(at person6 city5)
	(at person7 city9)
	(at person9 city4)
	))

(:metric minimize (+ (* 2 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (fly plane2 city6 city4)
   deleted: (at plane2 city6)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 0 to 717, (fuel plane2) from 768 to 51
   goals met: 2 of 8
2. (refuel plane1 city7)
   changed: (fuel plane1) from 3381 to 12394
   goals met: 2 of 8
3. (fly plane1 city7 city8)
   deleted: (at plane1 city7)
   added: (at plane1 city8)
   changed: (total-fuel-used) from 717 to 5702, (fuel plane1) from 12394 to 7409
   goals met: 2 of 8
4. (board person4 plane1 city8)
   deleted: (at person4 city8)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 8
5. (fly plane1 city8 city5)
   deleted: (at plane1 city8)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 5702 to 8472, (fuel plane1) from 7409 to 4639
   goals met: 2 of 8
6. (board person5 plane1 city5)
   deleted: (at person5 city5)
   added: (in person5 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 2 of 8
7. (fly plane1 city5 city0)
   deleted: (at plane1 city5)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 8472 to 12492, (fuel plane1) from 4639 to 619
   goals met: 2 of 8
8. (debark person4 plane1 city0)
   deleted: (in person4 plane1)
   added: (at person4 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 3 of 8
9. (board person2 plane1 city0)
   deleted: (at person2 city0)
   added: (in person2 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 8
10. (board person3 plane1 city0)
   deleted: (at person3 city0)
   added: (in person3 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 3 of 8
11. (refuel plane1 city0)
   changed: (fuel plane1) from 619 to 12394
   goals met: 3 of 8
12. (fly plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 12492 to 17172, (fuel plane1) from 12394 to 7714
   goals met: 3 of 8
13. (debark person2 plane1 city1)
   deleted: (in person2 plane1)
   added: (at person2 city1)
   changed: (onboard plane1) from 3 to 2
   goals met: 4 of 8
14. (fly plane1 city1 city7)
   deleted: (at plane1 city1)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 17172 to 21587, (fuel plane1) from 7714 to 3299
   goals met: 4 of 8
15. (debark person5 plane1 city7)
   deleted: (in person5 plane1)
   added: (at person5 city7)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 8
16. (debark person3 plane1 city7)
   deleted: (in person3 plane1)
   added: (at person3 city7)
   changed: (onboard plane1) from 1 to 0
   goals met: 6 of 8
17. (refuel plane2 city4)
   changed: (fuel plane2) from 51 to 2585
   goals met: 6 of 8
18. (fly plane2 city4 city6)
   deleted: (at plane2 city4)
   added: (at plane2 city6)
   changed: (total-fuel-used) from 21587 to 22304, (fuel plane2) from 2585 to 1868
   goals met: 6 of 8
19. (board person7 plane2 city6)
   deleted: (at person7 city6)
   added: (in person7 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 6 of 8
20. (board person9 plane2 city6)
   deleted: (at person9 city6)
   added: (in person9 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 6 of 8
21. (fly plane2 city6 city4)
   deleted: (at plane2 city6)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 22304 to 23021, (fuel plane2) from 1868 to 1151
   goals met: 6 of 8
22. (debark person9 plane2 city4)
   deleted: (in person9 plane2)
   added: (at person9 city4)
   changed: (onboard plane2) from 2 to 1
   goals met: 7 of 8
23. (fly plane2 city4 city9)
   deleted: (at plane2 city4)
   added: (at plane2 city9)
   changed: (total-fuel-used) from 23021 to 23955, (fuel plane2) from 1151 to 217
   goals met: 7 of 8
24. (debark person7 plane2 city9)
   deleted: (in person7 plane2)
   added: (at person7 city9)
   changed: (onboard plane2) from 1 to 0
   goals met: 8 of 8
